schreibfaul1/ESP32-audioI2S/src/Audio.cpp
    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(!f_stream) return; // 1. guard
    bool a = InBuff.bufferFilled() >= maxFrameSize;
    bool b = (m_audioDataSize  > 0) && (m_audioDataSize <= audioDataCount + maxFrameSize);
    if(!a && !b) return; // 2. guard   fill < frame && last frame(s)

    size_t data2decode = InBuff.bufferFilled();

    if(data2decode < maxFrameSize){
        if(m_audioDataSize - audioDataCount < maxFrameSize){
            data2decode = m_audioDataSize - audioDataCount;
        }
        else return;
    }
    else data2decode = maxFrameSize;

    if(m_streamType == ST_WEBFILE){

        bytesDecoded = sendBytes(InBuff.getReadPtr(), data2decode);
        if(bytesDecoded > 0) audioDataCount += bytesDecoded;

        if(byteCounter == m_contentlength){
            if(m_playlistFormat == FORMAT_M3U8){
                byteCounter = 0;
                m_metacount = m_metaint;
                m_f_continue = true;
                return;
            }
            f_webFileDataComplete = true;
        }
        if(m_audioDataSize == audioDataCount &&  m_controlCounter == 100) f_webFileAudioComplete = true;
    }
    else { // not a webfile
        if(m_controlCounter != 100 && (m_codec == CODEC_OGG || m_codec == CODEC_OGG_FLAC)) {  //application/ogg
            int res = read_OGG_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
            if(res >= 0) bytesDecoded = res;
            else { // error, skip header
                stopSong();
                m_controlCounter = 100;
            }
        }
        else{
            bytesDecoded = sendBytes(InBuff.getReadPtr(), data2decode);
        }
    }

    if(bytesDecoded < 0) {  // no syncword found or decode error, try next chunk
        uint8_t next = 200;
        if(InBuff.bufferFilled() < next) next = InBuff.bufferFilled();
        InBuff.getReadPtr();
        InBuff.bytesWasRead(next); // try next chunk
        m_bytesNotDecoded += next;
        if(m_streamType == ST_WEBFILE) audioDataCount += next;
        return;
    }
    else {
        if(bytesDecoded > 0) {InBuff.bytesWasRead(bytesDecoded); return;}
        if(bytesDecoded == 0) return; // syncword at pos0 found
    }
    return;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::processWebStreamTS() {

    const uint16_t  maxFrameSize = InBuff.getMaxBlockSize();    // every mp3/aac frame is not bigger
    uint32_t        availableBytes;                             // available bytes in stream
    static bool     f_tmr_1s;
    static bool     f_stream;                                   // first audio data received
    static int      bytesDecoded;
    static uint32_t byteCounter;                                // count received data
    static uint32_t tmr_1s;                                     // timer 1 sec
    static uint32_t loopCnt;                                    // count loops if clientbuffer is empty
    static uint8_t  ts_packet[188];                             // m3u8 transport stream is 188 bytes long
    uint8_t         ts_packetStart = 0;
    uint8_t         ts_packetLength = 0;
    static uint8_t  ts_packetPtr = 0;
    const uint8_t   ts_packetsize = 188;

    // first call, set some values to default - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(m_f_firstCall) { // runs only ont time per connection, prepare for start
        f_stream = false;
        byteCounter = 0;
        bytesDecoded = 0;
        loopCnt = 0;
        tmr_1s = millis();
        m_t0 = millis();
        ts_packetPtr = 0;
        ts_parsePacket(0, 0, 0); // reset ts routine
        if(m_contentlength % 188 != 0){
            // For files without an ID3 header, the content length is always divided by 188 without a remainder
            static size_t ID3frameSize = 0;
            uint8_t       ID3headerLength = 10;
            if(!ID3frameSize){
                uint8_t ID3headerLength = 10;
                if(_client->available() < ID3headerLength) return;
                _client->read(ts_packet, ID3headerLength);
                read_ID3_Header(ts_packet, ID3headerLength);
                ID3frameSize = m_ID3Size;
            }
            if(ID3frameSize > 188) {log_e("ID3 Header too long"); stopSong(); return;}
            if(_client->available() < ID3frameSize - ID3headerLength) return;
            _client->read(ts_packet, ID3frameSize - ID3headerLength);
            read_ID3_Header(ts_packet, ID3frameSize - ID3headerLength);
            byteCounter += ID3frameSize;
            ID3frameSize = 0;
        }
        m_f_firstCall = false;
    }

    if(m_datamode != AUDIO_DATA) return;        // guard
    int framesize = 0;

    availableBytes = _client->available();
    while(InBuff.freeSpace() >= ts_packetsize && availableBytes){
        int res = _client->read(ts_packet + ts_packetPtr, 188 - ts_packetPtr);
        if(res > 0){
            ts_packetPtr += res;
            if(ts_packetPtr < ts_packetsize)  return;
            ts_packetPtr = 0;
            ts_parsePacket(&ts_packet[0], &ts_packetStart, &ts_packetLength);

            if(ts_packetLength) {
                size_t ws = InBuff.writeSpace();
                if(ws >= ts_packetLength){
                    memcpy(InBuff.getWritePtr(), ts_packet + ts_packetStart, ts_packetLength);
                    InBuff.bytesWritten(ts_packetLength);
                }
                else{
                    memcpy(InBuff.getWritePtr(), ts_packet + ts_packetStart, ws);
                    InBuff.bytesWritten(ws);
                    memcpy(InBuff.getWritePtr(), &ts_packet[ws + ts_packetStart], ts_packetLength -ws);
                    InBuff.bytesWritten(ts_packetLength -ws);
                }
            }
            framesize += ts_packetLength;
            byteCounter += ts_packetsize;
            if(byteCounter == m_contentlength){
                byteCounter = 0;
                m_f_continue = true;
                break;
            }
            if(byteCounter > m_contentlength) log_e("byteCounter overflow");
            availableBytes = _client->available();
            if(framesize >= 512) break;
        }
        else {availableBytes = 0; break;}
    }
    // timer, triggers every second - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if((tmr_1s + 1000) < millis()) {
        f_tmr_1s = true;                                        // flag will be set every second for one loop only
        tmr_1s = millis();
    }

    // if the buffer is often almost empty issue a warning  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(InBuff.bufferFilled() < maxFrameSize && f_stream){
        static uint8_t cnt_slow = 0;
        cnt_slow ++;
        if(f_tmr_1s) {
            if(cnt_slow > 25 && audio_info) audio_info("slow stream, dropouts are possible");
            f_tmr_1s = false;
            cnt_slow = 0;
        }
    }

